Takashi949/bt_spp_acceptor/main/ESP32_i2c_LSM9DS1.cpp
	WriteByte(settings.AGdev_handle, ACT_DUR, duration);
}

uint8_t LSM9DS1::getInactivity()
{
	uint8_t temp;
	ReadBytes(settings.AGdev_handle, STATUS_REG_0, &temp, 1);
	temp &= (0x10);
	return temp;
}

void LSM9DS1::configAccelInt(uint8_t generator, bool andInterrupts)
{
	// Use variables from accel_interrupt_generator, OR'd together to create
	// the [generator]value.
	uint8_t temp = generator;
	if (andInterrupts) temp |= 0x80;
	WriteByte(settings.AGdev_handle, INT_GEN_CFG_XL, temp);
}

void LSM9DS1::configAccelThs(uint8_t threshold, lsm9ds1_axis axis, uint8_t duration, bool wait)
{
	// Write threshold value to INT_GEN_THS_?_XL.
	// axis will be 0, 1, or 2 (x, y, z respectively)
	WriteByte(settings.AGdev_handle, INT_GEN_THS_X_XL + axis, threshold);
	
	// Write duration and wait to INT_GEN_DUR_XL
	uint8_t temp;
	temp = (duration & 0x7F);
	if (wait) temp |= 0x80;
	WriteByte(settings.AGdev_handle, INT_GEN_DUR_XL, temp);
}

uint8_t LSM9DS1::getAccelIntSrc()
{
	uint8_t intSrc;
	ReadBytes(settings.AGdev_handle, INT_GEN_SRC_XL, &intSrc, 1);
	
	// Check if the IA_XL (interrupt active) bit is set
	if (intSrc & (1<<6))
	{
		return (intSrc & 0x3F);
	}
	
	return 0;
}

void LSM9DS1::configGyroInt(uint8_t generator, bool aoi, bool latch)
{
	// Use variables from accel_interrupt_generator, OR'd together to create
	// the [generator]value.
	uint8_t temp = generator;
	if (aoi) temp |= 0x80;
	if (latch) temp |= 0x40;
	WriteByte(settings.AGdev_handle, INT_GEN_CFG_G, temp);
}

void LSM9DS1::configGyroThs(int16_t threshold, lsm9ds1_axis axis, uint8_t duration, bool wait)
{
	uint8_t buffer[2];
	buffer[0] = (threshold & 0x7F00) >> 8;
	buffer[1] = (threshold & 0x00FF);
	// Write threshold value to INT_GEN_THS_?H_G and  INT_GEN_THS_?L_G.
	// axis will be 0, 1, or 2 (x, y, z respectively)
	WriteByte(settings.AGdev_handle, INT_GEN_THS_XH_G + (axis * 2), buffer[0]);
	WriteByte(settings.AGdev_handle, INT_GEN_THS_XH_G + 1 + (axis * 2), buffer[1]);
	
	// Write duration and wait to INT_GEN_DUR_XL
	uint8_t temp;
	temp = (duration & 0x7F);
	if (wait) temp |= 0x80;
	WriteByte(settings.AGdev_handle, INT_GEN_DUR_G, temp);
}

uint8_t LSM9DS1::getGyroIntSrc()
{
	uint8_t intSrc;
	ReadBytes(settings.AGdev_handle, INT_GEN_SRC_G, &intSrc, 1);
	
	// Check if the IA_G (interrupt active) bit is set
	if (intSrc & (1<<6))
	{
		return (intSrc & 0x3F);
	}
	
	return 0;
}

void LSM9DS1::configMagInt(uint8_t generator, h_lactive activeLow, bool latch)
{
	// Mask out non-generator bits (0-4)
	uint8_t config = (generator & 0xE0);	
	// IEA bit is 0 for active-low, 1 for active-high.
	if (activeLow == INT_ACTIVE_HIGH) config |= (1<<2);
	// IEL bit is 0 for latched, 1 for not-latched
	if (!latch) config |= (1<<1);
	// As long as we have at least 1 generator, enable the interrupt
	if (generator != 0) config |= (1<<0);
	
	WriteByte(settings.Mdev_handle, INT_CFG_M, config);
}

void LSM9DS1::configMagThs(uint16_t threshold)
{
	// Write high eight bits of [threshold] to INT_THS_H_M
	WriteByte(settings.Mdev_handle, INT_THS_H_M, uint8_t((threshold & 0x7F00) >> 8));
	// Write low eight bits of [threshold] to INT_THS_L_M
	WriteByte(settings.Mdev_handle, INT_THS_L_M, uint8_t(threshold & 0x00FF));
}

uint8_t LSM9DS1::getMagIntSrc()
{
	uint8_t intSrc;
	ReadBytes(settings.Mdev_handle, INT_SRC_M, &intSrc, 1);
	
	// Check if the INT (interrupt active) bit is set
	if (intSrc & (1<<0))
	{
		return (intSrc & 0xFE);
	}
	
	return 0;
}

void LSM9DS1::sleepGyro(bool enable)
{
	uint8_t temp;
	ReadBytes(settings.AGdev_handle, CTRL_REG9, &temp, 1);
	if (enable) temp |= (1<<6);
	else temp &= ~(1<<6);
	WriteByte(settings.AGdev_handle, CTRL_REG9, temp);
}

void LSM9DS1::enableFIFO(bool enable)
{
	uint8_t temp;
	ReadBytes(settings.AGdev_handle, CTRL_REG9, &temp, 1);
	if (enable) temp |= (1<<1);
	else temp &= ~(1<<1);
	WriteByte(settings.AGdev_handle, CTRL_REG9, temp);
}

void LSM9DS1::setFIFO(fifoMode_type fifoMode, uint8_t fifoThs)
{
	// Limit threshold - 0x1F (31) is the maximum. If more than that was asked
	// limit it to the maximum.
	uint8_t threshold = fifoThs <= 0x1F ? fifoThs : 0x1F;
	WriteByte(settings.AGdev_handle, FIFO_CTRL, ((fifoMode & 0x7) << 5) | (threshold & 0x1F));
}

uint8_t LSM9DS1::getFIFOSamples()
{
	uint8_t tmp;
	ReadBytes(settings.AGdev_handle, FIFO_SRC, &tmp, 1);

	return (tmp & 0x3F);
}

void LSM9DS1::constrainScales()
{
	if ((settings.gyro.scale != 245) && (settings.gyro.scale != 500) && 
		(settings.gyro.scale != 2000))
	{
		settings.gyro.scale = 245;
	}
		
	if ((settings.accel.scale != 2) && (settings.accel.scale != 4) &&
		(settings.accel.scale != 8) && (settings.accel.scale != 16))
	{
		settings.accel.scale = 2;
	}
		
	if ((settings.mag.scale != 4) && (settings.mag.scale != 8) &&
		(settings.mag.scale != 12) && (settings.mag.scale != 16))
	{
		settings.mag.scale = 4;
	}
}

void LSM9DS1::WriteByte(i2c_master_dev_handle_t dev_handle, uint8_t subAddress, uint8_t data)
{
	// Whether we're using I2C write a byte
	if (settings.device.commInterface == IMU_MODE_I2C){
		uint8_t writeBuf[] = {subAddress, data};
		i2c_master_transmit(dev_handle, writeBuf, sizeof(writeBuf), I2C_trans_timeout_ms);
	}
}

uint8_t LSM9DS1::ReadBytes(i2c_master_dev_handle_t dev_handle, uint8_t subAddress, uint8_t * dest, uint8_t count)
{
	// Whether we're using I2C , read multiple bytes
	if (settings.device.commInterface == IMU_MODE_I2C){
		esp_err_t err = i2c_master_transmit_receive(dev_handle, &subAddress, 1, dest, sizeof(dest), I2C_trans_timeout_ms);
		if(err == ESP_OK){
			return count;
		}
		ESP_LOGE("IMU class", "I2C write error %s", esp_err_to_name(err));
	}
	return -1;
}